In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
df = sns.load_dataset('titanic')

In [8]:
df1 = df.copy()

### 컬럼 추가

In [39]:
df1['vip'] = False

### 컬럼 삭제

In [50]:
df1.drop(1).head(1)
df1.drop([1, 3, 5, 7, 9]).head(1)
df1.drop(np.arange(10)).head(1)
# 원본 유지 재할당 필요

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
10,1,3,female,4.0,1,1,16.7,S,Third,child,False,G,Southampton,yes,False

In [51]:
df1.drop('class', axis=1).head(1)
# 컬럼삭제는 axis=1 필요
# (0 or index) (1 or colmns)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.25,S,man,True,NaN,Southampton,no,False

In [52]:
df1.drop(['class', 'who', 'alive'], axis=1).head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,adult_male,deck,embark_town,alone
0,0,3,male,22.0,1,0,7.2500,S,True,NaN,Southampton,False
1,1,1,female,38.0,1,0,71.2833,C,False,C,Cherbourg,False

In [53]:
df1.drop(['class', 'who', 'alive'], axis=1, inplace=True).head(1)
# inplace=True 원본에 적용 다양한 함수에 있음

AttributeError: 'NoneType' object has no attribute 'head'

### 컬럼 연산

In [54]:
df1 = df.copy()

In [45]:
df1['family'] = df1['sibsp'] + df1['parch']

In [46]:
# 내용이 있는 컬럼은 '특성' '피처' 등으로 불림 '특성공학'

In [47]:
# 글자도 가능

## 타입 변환

In [58]:
df1 = df.copy()

In [66]:
df1['who'] = df1['who'].astype('category')
# 원본 유지

In [67]:
df1['who'].dtype

CategoricalDtype(categories=['child', 'man', 'woman'], ordered=False, categories_dtype=object)

In [70]:
df1['who'].cat.rename_categories(['아이', '남성', '여성'])
df1['who'].value_counts()

who
man      537
woman    271
child     83
Name: count, dtype: int64

### datetime

In [73]:
dates = pd.date_range('20240101', periods=df.shape[0], freq='10h')
dates

DatetimeIndex(['2024-01-01 00:00:00', '2024-01-01 10:00:00',
               '2024-01-01 20:00:00', '2024-01-02 06:00:00',
               '2024-01-02 16:00:00', '2024-01-03 02:00:00',
               '2024-01-03 12:00:00', '2024-01-03 22:00:00',
               '2024-01-04 08:00:00', '2024-01-04 18:00:00',
               ...
               '2025-01-02 02:00:00', '2025-01-02 12:00:00',
               '2025-01-02 22:00:00', '2025-01-03 08:00:00',
               '2025-01-03 18:00:00', '2025-01-04 04:00:00',
               '2025-01-04 14:00:00', '2025-01-05 00:00:00',
               '2025-01-05 10:00:00', '2025-01-05 20:00:00'],
              dtype='datetime64[ns]', length=891, freq='10h')

In [74]:
df1['date'] = dates

In [99]:
# datetime 의 다양한 기능

## to_datetime

In [78]:
df = pd.read_csv('data/seoul_bicycle.csv')
df.head()

,대여일자,대여소번호,대여소명,대여구분코드,성별,연령대코드,이용건수,운동량,탄소량,이동거리,이용시간
0,Jan-20-2020,3,중랑센터,일일(회원),M,AGE_003,3,61.82,0.52,2230.0,75
1,Jan-20-2020,3,중랑센터,일일(회원),M,AGE_004,1,39.62,0.28,1220.0,15
2,Jan-20-2020,3,중랑센터,정기,M,AGE_005,3,430.85,4.01,17270.0,53
3,Jan-20-2020,5,상암센터 정비실,일일(회원),\N,AGE_005,2,1.79,0.02,90.0,33
4,Jan-20-2020,5,상암센터 정비실,정기,F,AGE_003,1,4501.96,45.47,196010.0,64

In [94]:
df1 = df.copy()

In [95]:
pd.to_datetime(df['대여일자'])
df['대여일자'] = pd.to_datetime(df['대여일자'], format='%b-%d-%Y')

In [108]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 327231 entries, 0 to 327230
Data columns (total 11 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   대여일자    327231 non-null  datetime64[ns]
 1   대여소번호   327231 non-null  int64
 2   대여소명    327231 non-null  object
 3   대여구분코드  327231 non-null  object
 4   성별      272841 non-null  object
 5   연령대코드   327231 non-null  object
 6   이용건수    327231 non-null  int64
 7   운동량     327231 non-null  object
 8   탄소량     327231 non-null  object
 9   이동거리    327231 non-null  float64
 10  이용시간    327231 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(3), object(6)
memory usage: 27.5+ MB

In [97]:
df1['대여일자'].dt.year.head()

0    2020
1    2020
2    2020
3    2020
4    2020
Name: 대여일자, dtype: int32

In [105]:
df1['운동량'] = pd.to_numeric(df1['운동량'], errors='coerce')

In [106]:
df1.loc[2344]

대여일자      2020-01-20 00:00:00
대여소번호                     165
대여소명              165. 중앙근린공원
대여구분코드                 일일(회원)
성별                         \N
연령대코드                 AGE_003
이용건수                        1
운동량                       NaN
탄소량                        \N
이동거리                      0.0
이용시간                       40
Name: 2344, dtype: object

In [126]:
bins = [0, 1000, 2000, 10000, 100000, df1['운동량'].max()]
pd.cut(df1['운동량'], bins).value_counts()
pd.cut(df1['운동량'], bins, labels=['적음', '보통', '많음', '초과', '불가']).value_counts()

운동량
적음    165919
많음     74885
보통     40331
초과     19307
불가       355
Name: count, dtype: int64

In [128]:
# 범위 균등 cut (값을 기준으로)
df1['운동량_cut'] = pd.cut(df1['운동량'], bins=10)
df1['운동량_cut'].value_counts()
# 이상치로 문제 발생

운동량_cut
(-163936.052, 16393605.23]      326816
(98361631.38, 114755236.61]          9
(32787210.46, 49180815.69]           2
(16393605.23, 32787210.46]           1
(114755236.61, 131148841.84]         1
(147542447.07, 163936052.3]          1
(81968026.15, 98361631.38]           0
(65574420.92, 81968026.15]           0
(49180815.69, 65574420.92]           0
(131148841.84, 147542447.07]         0
Name: count, dtype: int64

In [129]:
# 해당 value 균등 cut (범위를 기준으로)
df1['운동량_qcut'] = pd.qcut(df1['운동량'], q=10)
df1['운동량_qcut'].value_counts()

운동량_qcut
(93.414, 192.02]           32690
(-0.001, 24.737]           32683
(24.737, 93.414]           32683
(601.705, 1079.744]        32683
(1889.606, 3328.186]       32683
(1079.744, 1889.606]       32683
(3328.186, 6805.188]       32683
(6805.188, 163936052.3]    32683
(344.45, 601.705]          32680
(192.02, 344.45]           32679
Name: count, dtype: int64

In [139]:
qcut_bins = [0, 0.1, 0.2, 0.5, 0.8, 0.9, 1]
pd.qcut(df1['운동량'], qcut_bins, labels=['미미', '소', '중소','중대','대','극대']).value_counts()

운동량
미미    300783
중대        10
중소         2
소          1
극대         1
대          0
Name: count, dtype: int64

In [140]:
# 범위 ( 불포함  [포함